app/controllers/communities_controller.rb

SELECT "communities".* FROM "communities"
---
  def index
    @communities = Community.all

SELECT "posts".* FROM "posts" WHERE "posts"."community_id" = $1  [["community_id", 1]]
---
  def show
    @posts = @community.posts
    @subscriber_count = @community.subscribers.count
    @is_subscribed = account_signed_in? ? Subscription.where(community_id: @community.id, account_id: current_account.id).any? : false

INSERT INTO "communities" ("account_id", "name", "url", "rules", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @community = Community.new community_values
    @community.account_id = current_account.id

    if @community.save

SELECT "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @community = Community.find params[:id]

SELECT "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_community
    @community = Community.find params[:id]