app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @post = Post.find params[:id]

INSERT INTO "posts" ("account_id", "community_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["account_id", 1], ["community_id", 1], ["title", "My First Post"], ["body", "Testing body."], ["created_at", "2021-10-25 00:55:14.596360"], ["updated_at", "2021-10-25 00:55:14.596360"]]
SELECT "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @posts = Post.new post_values
    @posts.account_id = current_account.id
    @posts.community_id = params[:community_id]

    if @posts.save
      redirect_to community_path(@posts.community.id)
    else
      @community = Community.find params[:community_id]

SELECT "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @post = Post.new
    @community = Community.find params[:community_id]

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_post
    @posts = Post.find params[:id]