app/controllers/public_controller.rb

  def index
    @communities = Community.all.limit(5)
    @posts = Post.order(id: :desc).limit(20)
---
SELECT "communities".* FROM "communities" LIMIT $1  [["LIMIT", 5]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 20]]